<a href="https://colab.research.google.com/github/zje5027/Practice/blob/master/Finished_Zach_End's_GP3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#  ORIGINAL ER Diagram

![ER diagram of media rental sevice](https://nbviewer.jupyter.org/github/zje5027/Group_Lab_2/blob/main/Group%20Lab%202.png)

# UPDATED ER Diagram

Updated transaction table to get rid of repeating groups

fixed mismatched cardinality 

fixed connection between the user and transaction table

![Updated ER diagram](https://raw.githubusercontent.com/zje5027/Group_Project_2/main/Group%2520Lab%25202%20(1).png)

# Define SQL

In [ ]:
%load_ext sql
%sql sqlite:///libraryDatabase.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: @libraryDatabase.db'

# Create Tables

In [ ]:
%%sql  
DROP TABLE IF EXISTS Books;
create table Books (BOOK_ID_NUMBER text PRIMARY KEY, Author text, Publisher real, Genre text);

DROP table IF EXISTS Transactions;
create table Transactions (transactionID text PRIMARY KEY, RentalType text, DateTime text);

 * sqlite:///libraryDatabase.db
Done.
Done.
Done.
Done.

[]

In [ ]:
%%sql
DROP TABLE IF EXISTS Movies;
create table Movies (Title text PRIMARY KEY, Director text, Actors text, Playtime real);

DROP TABLE IF EXISTS Magazines;
create table Magazines (Issue text PRIMARY KEY, Publisher text, Date text, Journalist real);

DROP TABLE IF EXISTS Newspaper;
create table Newspaper (UniqueID text PRIMARY KEY, Company Name text, Issue text, Stories real);

DROP TABLE IF EXISTS user;
create table User (UserID text PRIMARY KEY, PaymentInfo text, Email text, PhoneNumber text, TransactionID real);

 * sqlite:///libraryDatabase.db
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

# Insert Data

In [ ]:
%%sql
insert into Books values ('98723171', 'George R R Martin', 1, 'Fantasy');
insert into Books values ('83231231', 'J K Rowling', 1, 'Fantasy');
insert into Books values ('75351143', 'Ernest Hemingway', 1, 'Fiction');
insert into Books values ('63532454', 'Mark Twain', 2, 'Non-Fiction');
insert into Books values ('55234231', 'F Scott Fitzgerald', 3, 'Fiction');
insert into Books values ('43423413', 'William Shakespeare', 4, 'Thriller');
insert into Books values ('34242312', 'Charles Dickens', 5, 'Mystery');

insert into Transactions values ('01', 'Book', '2020-11-14 19:12:54');
insert into Transactions values ('02', 'Movie', '2020-11-15 12:12:12');
insert into Transactions values ('03', 'Magazine', '2020-11-15 12:12:20');
insert into Transactions values ('04', 'Newspaper', '2020-11-15 12:12:23');
insert into Transactions values ('05', 'Book', '2019-11-15 19:34:23');
insert into Transactions values ('06', 'Movie', '2019-11-15 19:34:25');
insert into Transactions values ('07', 'Newspaper', '2019-11-15 19:34:30');
insert into Transactions values ('08', 'Book', '2019-11-15 19:40:03');
insert into Transactions values ('09', 'Movie', '2019-11-15 19:40:05');
insert into Transactions values ('10', 'Movie', '2019-11-15 19:41:30');

 * sqlite:///libraryDatabase.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql
insert into Movies values ('The Matrix', 'Wachowski Sisters','Keanu Reeves', 120);
insert into Movies values ('V for Vendetta', 'Wachowski Sisters', 'Hugo Weaving', 120);
insert into Movies values ('2001 A Space Odyssey', 'Stanley Kubrick', 'Keir Dullea', 120 );
insert into Movies values ('The Dark Knight', 'Christopher Nolan', 'Christian Bale', 120);
insert into Movies values ('21 JumpStreet', 'Zach End', "Joahna Hill", 90 );
insert into Movies values ('Spaceballs', 'Mel Gibson', 'Rick Moranis', 90 );
insert into Movies values ('John Wick', 'David Leitch', 'Keanu Reeves', 90 );

insert into Magazines values ('123', 'Timez','10/25/2000', 'Zach End');
insert into Magazines values ('132', 'Timez', '10/26/2001', 'Zach End');

insert into Newspaper values ('NEWS123', 'The Daily Bugal','Mike Evans', 15);
insert into Newspaper values ('NEWs132', 'The New Pork Times', 'Lamar Jackson', 12);


insert into User values ('Zach End', 'Visa Debit 0765', 'zje5027@hotmail.com', '4125555559', 55473893027 )

 * sqlite:///libraryDatabase.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

# PrintOut_Test

 check to make sure all tables were created correctly

In [ ]:
%%sql

select * from Books;

 * sqlite:///libraryDatabase.db
Done.

[('98723171', 'George R R Martin', 1.0, 'Fantasy'),
 ('83231231', 'J K Rowling', 1.0, 'Fantasy'),
 ('75351143', 'Ernest Hemingway', 1.0, 'Fiction'),
 ('63532454', 'Mark Twain', 2.0, 'Non-Fiction'),
 ('55234231', 'F Scott Fitzgerald', 3.0, 'Fiction'),
 ('43423413', 'William Shakespeare', 4.0, 'Thriller'),
 ('34242312', 'Charles Dickens', 5.0, 'Mystery')]

In [ ]:
%%sql
select * from Movies;

 * sqlite:///libraryDatabase.db
Done.

[('The Matrix', 'Wachowski Sisters', 'Keanu Reeves', 120.0),
 ('V for Vendetta', 'Wachowski Sisters', 'Hugo Weaving', 120.0),
 ('2001 A Space Odyssey', 'Stanley Kubrick', 'Keir Dullea', 120.0),
 ('The Dark Knight', 'Christopher Nolan', 'Christian Bale', 120.0),
 ('21 JumpStreet', 'Zach End', 'Joahna Hill', 90.0),
 ('Spaceballs', 'Mel Gibson', 'Rick Moranis', 90.0),
 ('John Wick', 'David Leitch', 'Keanu Reeves', 90.0)]

In [ ]:
%%sql

select * from Transactions;

 * sqlite:///libraryDatabase.db
Done.

[('01', 'Book', '2020-11-14 19:12:54'),
 ('02', 'Movie', '2020-11-15 12:12:12'),
 ('03', 'Magazine', '2020-11-15 12:12:20'),
 ('04', 'Newspaper', '2020-11-15 12:12:23'),
 ('05', 'Book', '2019-11-15 19:34:23'),
 ('06', 'Movie', '2019-11-15 19:34:25'),
 ('07', 'Newspaper', '2019-11-15 19:34:30'),
 ('08', 'Book', '2019-11-15 19:40:03'),
 ('09', 'Movie', '2019-11-15 19:40:05'),
 ('10', 'Movie', '2019-11-15 19:41:30')]

In [ ]:
%%sql

select * from Magazines;

 * sqlite:///libraryDatabase.db
Done.

[('123', 'Timez', '10/25/2000', 'Zach End'),
 ('132', 'Timez', '10/26/2001', 'Zach End')]

In [ ]:
%%sql 
select * from Newspaper;

 * sqlite:///libraryDatabase.db
Done.

[('NEWS123', 'The Daily Bugal', 'Mike Evans', 15.0),
 ('NEWs132', 'The New Pork Times', 'Lamar Jackson', 12.0)]

# Questions

How many authors have the letters 'e' and 's' next to each other?

In [ ]:
%%sql

select Author from Books where Author like '%es%';

 * sqlite:///libraryDatabase.db
Done.

[('Ernest Hemingway',), ('William Shakespeare',), ('Charles Dickens',)]

How many transactions were completed on the 15th of Novemebr in 2019?

In [ ]:
%%sql

select count(transactionID) from transactions where DateTime like '2019-11-15%';

 * sqlite:///libraryDatabase.db
Done.

[(6,)]

What is the longest movie that can be rented that features Keanu Reeves as the main actor?

In [ ]:
%%sql
select Title, max(playtime) from Movies WHERE Actors LIKE '%Keanu%';

 * sqlite:///libraryDatabase.db
Done.

[('The Matrix', 120.0)]

I picked these three questions becasue each of them showcase a diffrent function of SQL and they fit with the buisness model as these are relistic things that customers could want to search for on the service.